In [11]:
import pandas as pd 
import numpy as np 


df = pd.read_csv("ejemplo.csv")

In [12]:
df['Maximo'] = df.max(axis=1)

In [13]:
#df.insert(4,'Maximo','')
print(df)

   numero1  numero2  numero3  numero4  Maximo
0        1        2        3        4       4
1        5        4        3        2       5
2        1        5        4        2       5
3        1        1        6        3       6

In [14]:
df.to_csv("ejemplo2.csv")

In [51]:
ds = pd.read_csv("ecdc_europa.csv")

In [52]:
valores = {'Countries and territories': ds.countriesAndTerritories,
        'cases': ds.cases, 'deaths' : ds.deaths
        }

In [53]:
df2 = pd.DataFrame(valores)

In [54]:
#df2.groupby(by=df.columns, axis=1).sum()
df2

     Countries and territories  cases  deaths
0                  Afghanistan     27       0
1                  Afghanistan      8       1
2                  Afghanistan     15       1
3                  Afghanistan     16       1
4                  Afghanistan      0       0
...                        ...    ...     ...
7899                  Zimbabwe      0       0
7900                  Zimbabwe      0       1
7901                  Zimbabwe      0       0
7902                  Zimbabwe      1       0
7903                  Zimbabwe      1       0

[7904 rows x 3 columns]

In [55]:
res = df2.groupby(['Countries and territories']).sum()

In [58]:
res

                           cases  deaths
Countries and territories
Afghanistan                  141       4
Albania                      223      12
Algeria                      511      31
Andorra                      370       8
Angola                         7       2
...                          ...     ...
Uzbekistan                   149       2
Venezuela                    135       3
Vietnam                      229       0
Zambia                        35       0
Zimbabwe                       7       1

[199 rows x 2 columns]

In [59]:
res.to_csv("resultado_suma.csv")